Revit 2027 API
ParameterValueProvider Constructor
 Constructs an instance of ParameterValueProvider.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ParameterValueProvider(
	ElementId parameter
)
Public Sub New (
	parameter As ElementId
)
public:
ParameterValueProvider(
	ElementId^ parameter
)
new :
        parameter : ElementId -> ParameterValueProvider
Parameters
parameter ElementId
 The parameter used to provide a string, integer, and double-precision, or ElementId value on request for a given element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterValueProvider Class
Autodesk.Revit.DB Namespace